иб/src/Catalogs/Препараты/Препараты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Препараты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вакцина</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПрименения</name>
    <type>
      <types>CatalogRef.СпособыПримененияПрепаратов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаХраненияОстатков</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.сжсвСтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаДляОтчетов</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляПодсосных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособСписания</name>
    <type>
      <types>EnumRef.сжсвМетодыРаспределенияМатериалов</types>
    </type>
  </attributes>
  <attributes>
    <name>НормаРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РекомендацииПоПрименению</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокВывода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состав</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>CatalogRef.новФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРаспределенияЗаказа</name>
    <type>
      <types>EnumRef.сжсвМетодыРаспределенияВетПрепарата</types>
    </type>
  </attributes>
  <attributes>
    <name>НормаРаспределения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьРаспределения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтраховойЗапас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйЗаказ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПрепарата</name>
    <type>
      <types>EnumRef.сжсвТипыВетПрепаратов</types>
    </type>
  </attributes>
  <attributes>
    <name>Инструкция</name>
    <type>
      <types>CatalogRef.новФайлы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПоражаемыеЗаболевания</name>
    <attributes>
      <name>Заболевание</name>
      <type>
        <types>CatalogRef.Заболевания</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоражаемыеВозбудители</name>
    <attributes>
      <name>Возбудитель</name>
      <type>
        <types>CatalogRef.Возбудители</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

иб/src/Catalogs/Препараты/Forms/ФормаЭлементаУпр/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьКратности();
	Если ПолучитьЗначениеФункцОпцииРасширУчетВетПрепаратов() тогда
	ОбщегоНазначенияКлиентСервер.ВыборПрепарата(Объект,Отказ);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СпособСписанияПриИзменении(Элемент)
	
	УстановитьВидимостьКратности();
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	если НЕ ЗначениеЗаполнено(Объект.ПолноеНаименование) тогда
		Объект.ПолноеНаименование = Объект.Наименование;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаХраненияОстатковНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	если Объект.Ссылка.Пустая() И НЕ Записать() тогда
		СтандартнаяОбработка = ложь;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаДляОтчетовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	если Объект.Ссылка.Пустая() И НЕ Записать() тогда
		СтандартнаяОбработка = ложь;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СпособРаспределенияЗаказаПриИзменении(Элемент)
	УстановитьВидимостьКратности();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Фото = ПолучитьНавигационнуюСсылку(Объект.Картинка, "Файл");
	Элементы.Фото.РазмерКартинки = РазмерКартинки.АвтоРазмер; 
КонецПроцедуры

&НаКлиенте
Процедура КартинкаПриИзменении(Элемент)
	Фото = ПолучитьНавигационнуюСсылку(Объект.Картинка, "Файл");
	Элементы.Фото.РазмерКартинки = РазмерКартинки.АвтоРазмер;
КонецПроцедуры

&НаКлиенте
Процедура КартинкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		СтандартнаяОбработка = Ложь;
	Парам = Новый Структура("Владелец", объект.ссылка);
	ОткрытьФорму("Справочник.новФайлы.Форма.ФормаВыбора",Парам, Элемент);

КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьЗначениеФункцОпцииРасширУчетВетПрепаратов()
	
Возврат ПолучитьФункциональнуюОпцию("ВестиРасширенныйУчетВетПрепаратов");

КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьКратности()
	
	Если Объект.СпособСписания = ПредопределенноеЗначение("Перечисление.сжсвМетодыРаспределенияМатериалов.ПоМассе") Тогда
		Элементы.ГруппаКратность.Видимость = Истина;
	Иначе
		Элементы.ГруппаКратность.Видимость = Ложь;
	КонецЕсли;
	
		Если Объект.СпособРаспределенияЗаказа = ПредопределенноеЗначение("Перечисление.сжсвМетодыРаспределенияВетПрепарата.ПоМассе") Тогда
		Элементы.ГруппаНормаКратность.Видимость = Истина;
		Элементы.ГруппаКратностьНорма.Видимость = Истина;
		Элементы.ГруппаТочекЗаказа.Видимость=Ложь;
	ИначеЕсли Объект.СпособРаспределенияЗаказа = ПредопределенноеЗначение("Перечисление.сжсвМетодыРаспределенияВетПрепарата.ПоГоловам") Тогда
		Элементы.ГруппаКратностьНорма.Видимость = Истина;
		Элементы.ГруппаНормаКратность.Видимость = Ложь;
		Элементы.ГруппаТочекЗаказа.Видимость=Ложь;
	Иначе 
		Элементы.ГруппаКратностьНорма.Видимость = Ложь;
		Элементы.ГруппаТочекЗаказа.Видимость=Истина;
	КонецЕсли;

	
КонецПроцедуры

#КонецОбласти
